AcRxOverrule.isOverruling
Queries if the global overruling flag is true or false.
Returns:
Returns true if overruling is currently turned on, false otherwise.

AcRxOverrule.setIsOverruling(System.Boolean)
Globally (application-wise) enable or disable overruling mechanism.
bIsOverruling: True to enable overruling, false to disable.
Remarks:
Overrule can be turned ON or OFF across the entire application. Does not
support per-document enabling or disabling.

AcRxOverrule.removeOverrule(AcRxClass*,AcRxOverrule*)
Unregister an overrule object from an AcRxClass.
pClass: AcRxClass to which "pOverrule" was applied.
pOverrule: AcRxOverrule derived object to remove.
Remarks:
The parameters should match the parameters when addOverrule was called.
Returns:
Returns Acad::Ok if the overrule was registered and is now removed from the overrule collection by this call.

AcRxOverrule.addOverrule(AcRxClass*,AcRxOverrule*,System.Boolean)
Registers an overrule object to an AcRxClass.
pClass: Pointer to an AcRxClass to which "pOverrule" is intended to apply.
pOverrule: Pointer to an AcRxOverrule derived object to overrule.
bAddAtLast: Indicates whether the {pClass, pOverrule} pair should be added at
the end of the overrule's collection.
Remarks:
You should ensure "pOverrule" is appropriate for "pClass". If "pOverrule" can't
overrule behaviors in "pClass", then "pOverrule" will have no effect. If more than one
overrule specifies bAddAtLast to be true, then their orders will be determined
by last in first out.
Returns:
Returns true if the overrule is successfully added.

AcRxOverrule.isApplicable(AcRxObject!System.Runtime.CompilerServices.IsConst*)
Used to make per-instance determination whether the overrule is applicable.
Returns:
Returns true if overruling of the overrule should be applied when queried, false otherwise.
pOverruledSubject: Pointer to an AcRxObject to check.
Remarks:
If pOverruledSubject is database resident then it is open for read.

AcRxOverrule
AcRxOverrule is an abstract base class for implementing
overrules. Overrule providers register and unregister their
overrules through addOverrule and removeOverrule. Overrules
can be globally activated or deactivated by setIsOverruling.
It can also be queried by isOverruleing.
Overrules are internally managed by pairs of "targetClass"
and "overrule". The "targetClass" is the class that
"overrule" is intended to own. Each class can have multiple
overrules registered and their order is implied by the order
they are registered.
Each derived overrule class should provide some or all
default implementations that delegate to the default behavior
for the targeted class.